posts/2015-01-13-the-third-sunday-of-easter.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: The Third Sunday of Easter

/On the Tenth Anniversary of NorthHaven Church/

For those who have given much\\
And have gone on to their eternal rest,\\
We give thanks.

For those who labor joyfully\\
So that others may see Jesus,\\
We give thanks.

For both laughter and tears,\\
When shared with those who love deeply,\\
We give thanks.

And for a church where Christ is proclaimed\\
Yet an Imam feels welcome,\\
We give thanks.

/Amen/


"Now that you have purified your souls by your obedience to the truth so that you have genuine mutual love, love one another deeply from the heart." (1 Peter 1:22)
