docs/posts/2015-01-13-the-third-sunday-of-easter.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Third Sunday of Easter</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Third Sunday of Easter</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
<i>On the Tenth Anniversary of NorthHaven Church</i>
</p>

<p>
For those who have given much<br>
And have gone on to their eternal rest,<br>
We give thanks.
</p>

<p>
For those who labor joyfully<br>
So that others may see Jesus,<br>
We give thanks.
</p>

<p>
For both laughter and tears,<br>
When shared with those who love deeply,<br>
We give thanks.
</p>

<p>
And for a church where Christ is proclaimed<br>
Yet an Imam feels welcome,<br>
We give thanks.
</p>

<p>
<i>Amen</i>
</p>


<p>
&ldquo;Now that you have purified your souls by your obedience to the truth so that you have genuine mutual love, love one another deeply from the heart.&rdquo; (1 Peter 1:22)
</p>


<div class="tagline" id="org136cc96">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
